doc/TCRD_Build_Notes.org
#+OPTIONS: toc:nil

* UniProt
** *Download Required:* No
** *Pre-processing required:* None
** *Manual post-processing:* Manual database update of gene ids for GPR89A/B
** *Approx. total time*: 16 hours
* IDG Family Assignments
** *Download Required:* No
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
* NCBI GI Numbers
** *Download Required:* No, done by loader
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 4 minutes
* HGNC
** *Download Required:* No
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 17 hours
* STRING IDs
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 35 minutes
* Antibodypedia
** *Download Required:* No
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 1.5 days
* NCBI Gene
** *Download Required:* No
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 1.3 days
* JensenLab PubMed Scores
** *Download Required:* No, done by loader
** *Pre-processing required:* None
** *Manual post-processing:* Yes. Generate and run SQL to set missing values to zero.
** *Approx. total time*: 10 minutes
* Drug Central
** *Download Required:* Yes. This data must currently be obtained directly from Oleg.
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 5 minutes
* ChEMBL 
** *Download Required:* Yes.
** *Pre-processing required:* Yes. ChEMBL MySQL database must be built from download.
** *Manual post-processing:* None
** *Approx. total time*: 15 minutes
* OMIM
** *Download Required:* Yes. Requires registration to get user-specific download links.
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 5 minutes
* Experimental MF/BP Leaf Term GOA
** *Download Required:* No, done by loader
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 30 minutes

* TDLs
** *Download Required:* No
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 
* EBI Patent Counts
** *Download Required:* Data obtained directly from EBI.
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
* PubTator Scores
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 40 minutes

* GWAS Catalog
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 5 minutes
