doc/TCRD_Build_Notes.org
* IMPC Phenotypes
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 10 minutes
* JAX Phenotypes
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 5 minutes
* JensenLab DISEASES
** *Download Required:* No, done by loader
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 10 minutes
* DisGeNET
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 5 minutes
* Drugable Epigenome Info
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
* MLP Assay Info
** *Download Required:* 
** *Pre-processing required:* Yes. Files are generated from PubChem and EUtils data by Jeremy.
** *Manual post-processing:* None
** *Approx. total time*: 1.5 hours for load. Not sure of time for pre-processing.
* NIH Grant Info
** *Download Required:* Yes. Project and abstract files must be downloaded from NIH Exporter.
** *Pre-processing required:* Yes.
*** Project info is collected and saved. Code provided.
*** JensenLab Tagger run on Project and abstract files.
** *Manual post-processing:* None
** *Approx. total time*: 8 hours
* TIN-X
** *Download Required:* No, done by pre-processing code.
** *Pre-processing required:* Yes. Code provided.
** *Manual post-processing:* None
** *Approx. total time*: 8 hours
* PubMed Abstracts
** *Download Required:* No
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 4.5 days
* Harmonizome
** *Download Required:* No
** *Pre-processing required:* Yes
** *Manual post-processing:* Yes
** *Approx. total time*: > 10 days
* GTEx
** *Download Required:* Yes
** *Pre-processing required:* Yes. R code provided.
** *Manual post-processing:* None
** *Approx. total time*: 5 hours for load. Not sure of time for pre-processing.
* JensenLan TISSUES
** *Download Required:* No, done by loader
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 10 minutes
* Human Protein Atlas
** *Download Required:* Yes
** *Pre-processing required:* Yes. R code provided.
** *Manual post-processing:* None
** *Approx. total time*: 2 hours for load. Not sure of time for pre-processing.
* Human Proteome Map
** *Download Required:* Yes
** *Pre-processing required:* Yes. R code provided.
** *Manual post-processing:* None
