doc/TCRD_Build_Notes.html
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-15-3" class="outline-3">
<h3 id="sec-15-3"><span class="section-number-3">15.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-15-4" class="outline-3">
<h3 id="sec-15-4"><span class="section-number-3">15.4</span> <b>Approx. total time</b>: 40 minutes</h3>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> GWAS Catalog</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-16-4" class="outline-3">
<h3 id="sec-16-4"><span class="section-number-3">16.4</span> <b>Approx. total time</b>: 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> IMPC Phenotypes</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><span class="section-number-3">17.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-17-3" class="outline-3">
<h3 id="sec-17-3"><span class="section-number-3">17.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-17-4" class="outline-3">
<h3 id="sec-17-4"><span class="section-number-3">17.4</span> <b>Approx. total time</b>: 10 minutes</h3>
</div>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> JAX Phenotypes</h2>
<div class="outline-text-2" id="text-18">
</div><div id="outline-container-sec-18-1" class="outline-3">
<h3 id="sec-18-1"><span class="section-number-3">18.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-18-2" class="outline-3">
<h3 id="sec-18-2"><span class="section-number-3">18.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-18-3" class="outline-3">
<h3 id="sec-18-3"><span class="section-number-3">18.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-18-4" class="outline-3">
<h3 id="sec-18-4"><span class="section-number-3">18.4</span> <b>Approx. total time</b>: 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> JensenLab DISEASES</h2>
<div class="outline-text-2" id="text-19">
</div><div id="outline-container-sec-19-1" class="outline-3">
<h3 id="sec-19-1"><span class="section-number-3">19.1</span> <b>Download Required:</b> No, done by loader</h3>
</div>
<div id="outline-container-sec-19-2" class="outline-3">
<h3 id="sec-19-2"><span class="section-number-3">19.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-19-3" class="outline-3">
<h3 id="sec-19-3"><span class="section-number-3">19.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-19-4" class="outline-3">
<h3 id="sec-19-4"><span class="section-number-3">19.4</span> <b>Approx. total time</b>: 10 minutes</h3>
</div>
</div>
<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> DisGeNET</h2>
<div class="outline-text-2" id="text-20">
</div><div id="outline-container-sec-20-1" class="outline-3">
<h3 id="sec-20-1"><span class="section-number-3">20.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-20-2" class="outline-3">
<h3 id="sec-20-2"><span class="section-number-3">20.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-20-3" class="outline-3">
<h3 id="sec-20-3"><span class="section-number-3">20.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-20-4" class="outline-3">
<h3 id="sec-20-4"><span class="section-number-3">20.4</span> <b>Approx. total time</b>: 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Drugable Epigenome Info</h2>
<div class="outline-text-2" id="text-21">
</div><div id="outline-container-sec-21-1" class="outline-3">
<h3 id="sec-21-1"><span class="section-number-3">21.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-21-2" class="outline-3">
<h3 id="sec-21-2"><span class="section-number-3">21.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-21-3" class="outline-3">
<h3 id="sec-21-3"><span class="section-number-3">21.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-21-4" class="outline-3">
<h3 id="sec-21-4"><span class="section-number-3">21.4</span> <b>Approx. total time</b>: &lt; 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> MLP Assay Info</h2>
<div class="outline-text-2" id="text-22">
</div><div id="outline-container-sec-22-1" class="outline-3">
<h3 id="sec-22-1"><span class="section-number-3">22.1</span> <b>Download Required:</b></h3>
</div>
<div id="outline-container-sec-22-2" class="outline-3">
<h3 id="sec-22-2"><span class="section-number-3">22.2</span> <b>Pre-processing required:</b> Yes. Files are generated from PubChem and EUtils data by Jeremy.</h3>
</div>
<div id="outline-container-sec-22-3" class="outline-3">
<h3 id="sec-22-3"><span class="section-number-3">22.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-22-4" class="outline-3">
<h3 id="sec-22-4"><span class="section-number-3">22.4</span> <b>Approx. total time</b>: 1.5 hours for load. Not sure of time for pre-processing.</h3>
</div>
</div>
<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> NIH Grant Info</h2>
<div class="outline-text-2" id="text-23">
</div><div id="outline-container-sec-23-1" class="outline-3">
<h3 id="sec-23-1"><span class="section-number-3">23.1</span> <b>Download Required:</b> Yes. Project and abstract files must be downloaded from NIH Exporter.</h3>
</div>
<div id="outline-container-sec-23-2" class="outline-3">
<h3 id="sec-23-2"><span class="section-number-3">23.2</span> <b>Pre-processing required:</b> Yes.</h3>
<div class="outline-text-3" id="text-23-2">
</div><div id="outline-container-sec-23-2-1" class="outline-4">
<h4 id="sec-23-2-1"><span class="section-number-4">23.2.1</span> Project info is collected and saved. Code provided.</h4>
</div>
<div id="outline-container-sec-23-2-2" class="outline-4">
<h4 id="sec-23-2-2"><span class="section-number-4">23.2.2</span> JensenLab Tagger run on Project and abstract files.</h4>
</div>
</div>
<div id="outline-container-sec-23-3" class="outline-3">
<h3 id="sec-23-3"><span class="section-number-3">23.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-23-4" class="outline-3">
<h3 id="sec-23-4"><span class="section-number-3">23.4</span> <b>Approx. total time</b>: 8 hours</h3>
</div>
</div>
<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> TIN-X</h2>
<div class="outline-text-2" id="text-24">
</div><div id="outline-container-sec-24-1" class="outline-3">
<h3 id="sec-24-1"><span class="section-number-3">24.1</span> <b>Download Required:</b> No, done by pre-processing code.</h3>
</div>
<div id="outline-container-sec-24-2" class="outline-3">
<h3 id="sec-24-2"><span class="section-number-3">24.2</span> <b>Pre-processing required:</b> Yes. Code provided.</h3>
</div>
<div id="outline-container-sec-24-3" class="outline-3">
<h3 id="sec-24-3"><span class="section-number-3">24.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-24-4" class="outline-3">
<h3 id="sec-24-4"><span class="section-number-3">24.4</span> <b>Approx. total time</b>: 8 hours</h3>
</div>
</div>
<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> PubMed Abstracts</h2>
<div class="outline-text-2" id="text-25">
</div><div id="outline-container-sec-25-1" class="outline-3">
<h3 id="sec-25-1"><span class="section-number-3">25.1</span> <b>Download Required:</b> No</h3>
</div>
<div id="outline-container-sec-25-2" class="outline-3">
<h3 id="sec-25-2"><span class="section-number-3">25.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-25-3" class="outline-3">
<h3 id="sec-25-3"><span class="section-number-3">25.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-25-4" class="outline-3">
<h3 id="sec-25-4"><span class="section-number-3">25.4</span> <b>Approx. total time</b>: 4.5 days</h3>
</div>
</div>
<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> Harmonizome</h2>
<div class="outline-text-2" id="text-26">
</div><div id="outline-container-sec-26-1" class="outline-3">
<h3 id="sec-26-1"><span class="section-number-3">26.1</span> <b>Download Required:</b> No</h3>
</div>
<div id="outline-container-sec-26-2" class="outline-3">
<h3 id="sec-26-2"><span class="section-number-3">26.2</span> <b>Pre-processing required:</b> Yes</h3>
</div>
<div id="outline-container-sec-26-3" class="outline-3">
<h3 id="sec-26-3"><span class="section-number-3">26.3</span> <b>Manual post-processing:</b> Yes</h3>
</div>
<div id="outline-container-sec-26-4" class="outline-3">
<h3 id="sec-26-4"><span class="section-number-3">26.4</span> <b>Approx. total time</b>: &gt; 10 days</h3>
</div>
</div>
<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> GTEx</h2>
<div class="outline-text-2" id="text-27">
</div><div id="outline-container-sec-27-1" class="outline-3">
<h3 id="sec-27-1"><span class="section-number-3">27.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-27-2" class="outline-3">
<h3 id="sec-27-2"><span class="section-number-3">27.2</span> <b>Pre-processing required:</b> Yes. R code provided.</h3>
</div>
<div id="outline-container-sec-27-3" class="outline-3">
<h3 id="sec-27-3"><span class="section-number-3">27.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-27-4" class="outline-3">
<h3 id="sec-27-4"><span class="section-number-3">27.4</span> <b>Approx. total time</b>: 5 hours for load. Not sure of time for pre-processing.</h3>
</div>
</div>
<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> JensenLan TISSUES</h2>
<div class="outline-text-2" id="text-28">
</div><div id="outline-container-sec-28-1" class="outline-3">
<h3 id="sec-28-1"><span class="section-number-3">28.1</span> <b>Download Required:</b> No, done by loader</h3>
</div>
<div id="outline-container-sec-28-2" class="outline-3">
<h3 id="sec-28-2"><span class="section-number-3">28.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-28-3" class="outline-3">
<h3 id="sec-28-3"><span class="section-number-3">28.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-28-4" class="outline-3">
<h3 id="sec-28-4"><span class="section-number-3">28.4</span> <b>Approx. total time</b>: 10 minutes</h3>
</div>
</div>
<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> Human Protein Atlas</h2>
<div class="outline-text-2" id="text-29">
</div><div id="outline-container-sec-29-1" class="outline-3">
<h3 id="sec-29-1"><span class="section-number-3">29.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-29-2" class="outline-3">
<h3 id="sec-29-2"><span class="section-number-3">29.2</span> <b>Pre-processing required:</b> Yes. R code provided.</h3>
</div>
<div id="outline-container-sec-29-3" class="outline-3">
<h3 id="sec-29-3"><span class="section-number-3">29.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-29-4" class="outline-3">
<h3 id="sec-29-4"><span class="section-number-3">29.4</span> <b>Approx. total time</b>: 2 hours for load. Not sure of time for pre-processing.</h3>
</div>
</div>
<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> Human Proteome Map</h2>
