doc/TCRD_Build_Notes.org
** *Approx. total time*: 1 hour for load. Not sure of time for pre-processing.
* Consensus Expression Values
** *Download Required:* No
** *Pre-processing required:* No, done by loader.
** *Manual post-processing:* None
** *Approx. total time*: 30 minutes
* Expression Atlas
** *Download Required:* Yes
** *Pre-processing required:* Yes. R code provided.
** *Manual post-processing:* None
** *Approx. total time*: 20 minutes for load. Not sure of time for pre-processing.
* DTO
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* Manual database updates for root nodes.
** *Approx. total time*: < 5 minutes

* Reactome PPIs
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
* BioPlex PPIs
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
* KEGG Pathways
** *Download Required:* No
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 10 minutes
* KEGG Distances
** *Download Required:* Yes
** *Pre-processing required:* No, done by loader.
** *Manual post-processing:* None
** *Approx. total time*: 10 minutes
* KEGG Nearest Tclin
** *Download Required:* No
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
* WikiPathways
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
* Reactome Pathways
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 15 minutes
* PathwayCommons
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
* JensenLab COMPARTMENTS
** *Download Required:* No, done by loader
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: 40 minutes
* Transcription Factor Flags
** *Download Required:* Yes
** *Pre-processing required:* Yes
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
* TMHMM Predictions
** *Download Required:* Yes
** *Pre-processing required:* Yes
** *Manual post-processing:* None
** *Approx. total time*: 1 hour
* PANTHER Classes
** *Download Required:* Yes
** *Pre-processing required:* None
** *Manual post-processing:* None
** *Approx. total time*: < 5 minutes
