doc/TCRD_Build_Notes.html
<div class="outline-text-2" id="text-30">
</div><div id="outline-container-sec-30-1" class="outline-3">
<h3 id="sec-30-1"><span class="section-number-3">30.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-30-2" class="outline-3">
<h3 id="sec-30-2"><span class="section-number-3">30.2</span> <b>Pre-processing required:</b> Yes. R code provided.</h3>
</div>
<div id="outline-container-sec-30-3" class="outline-3">
<h3 id="sec-30-3"><span class="section-number-3">30.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-30-4" class="outline-3">
<h3 id="sec-30-4"><span class="section-number-3">30.4</span> <b>Approx. total time</b>: 1 hour for load. Not sure of time for pre-processing.</h3>
</div>
</div>
<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> Consensus Expression Values</h2>
<div class="outline-text-2" id="text-31">
</div><div id="outline-container-sec-31-1" class="outline-3">
<h3 id="sec-31-1"><span class="section-number-3">31.1</span> <b>Download Required:</b> No</h3>
</div>
<div id="outline-container-sec-31-2" class="outline-3">
<h3 id="sec-31-2"><span class="section-number-3">31.2</span> <b>Pre-processing required:</b> No, done by loader.</h3>
</div>
<div id="outline-container-sec-31-3" class="outline-3">
<h3 id="sec-31-3"><span class="section-number-3">31.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-31-4" class="outline-3">
<h3 id="sec-31-4"><span class="section-number-3">31.4</span> <b>Approx. total time</b>: 30 minutes</h3>
</div>
</div>
<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> Expression Atlas</h2>
<div class="outline-text-2" id="text-32">
</div><div id="outline-container-sec-32-1" class="outline-3">
<h3 id="sec-32-1"><span class="section-number-3">32.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-32-2" class="outline-3">
<h3 id="sec-32-2"><span class="section-number-3">32.2</span> <b>Pre-processing required:</b> Yes. R code provided.</h3>
</div>
<div id="outline-container-sec-32-3" class="outline-3">
<h3 id="sec-32-3"><span class="section-number-3">32.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-32-4" class="outline-3">
<h3 id="sec-32-4"><span class="section-number-3">32.4</span> <b>Approx. total time</b>: 20 minutes for load. Not sure of time for pre-processing.</h3>
</div>
</div>
<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> DTO</h2>
<div class="outline-text-2" id="text-33">
</div><div id="outline-container-sec-33-1" class="outline-3">
<h3 id="sec-33-1"><span class="section-number-3">33.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-33-2" class="outline-3">
<h3 id="sec-33-2"><span class="section-number-3">33.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-33-3" class="outline-3">
<h3 id="sec-33-3"><span class="section-number-3">33.3</span> <b>Manual post-processing:</b> Manual database updates for root nodes.</h3>
</div>
<div id="outline-container-sec-33-4" class="outline-3">
<h3 id="sec-33-4"><span class="section-number-3">33.4</span> <b>Approx. total time</b>: &lt; 5 minutes</h3>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> Reactome PPIs</h2>
<div class="outline-text-2" id="text-34">
</div><div id="outline-container-sec-34-1" class="outline-3">
<h3 id="sec-34-1"><span class="section-number-3">34.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-34-2" class="outline-3">
<h3 id="sec-34-2"><span class="section-number-3">34.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-34-3" class="outline-3">
<h3 id="sec-34-3"><span class="section-number-3">34.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-34-4" class="outline-3">
<h3 id="sec-34-4"><span class="section-number-3">34.4</span> <b>Approx. total time</b>: &lt; 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> BioPlex PPIs</h2>
<div class="outline-text-2" id="text-35">
</div><div id="outline-container-sec-35-1" class="outline-3">
<h3 id="sec-35-1"><span class="section-number-3">35.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-35-2" class="outline-3">
<h3 id="sec-35-2"><span class="section-number-3">35.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-35-3" class="outline-3">
<h3 id="sec-35-3"><span class="section-number-3">35.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-35-4" class="outline-3">
<h3 id="sec-35-4"><span class="section-number-3">35.4</span> <b>Approx. total time</b>: &lt; 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> KEGG Pathways</h2>
<div class="outline-text-2" id="text-36">
</div><div id="outline-container-sec-36-1" class="outline-3">
<h3 id="sec-36-1"><span class="section-number-3">36.1</span> <b>Download Required:</b> No</h3>
</div>
<div id="outline-container-sec-36-2" class="outline-3">
<h3 id="sec-36-2"><span class="section-number-3">36.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-36-3" class="outline-3">
<h3 id="sec-36-3"><span class="section-number-3">36.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-36-4" class="outline-3">
<h3 id="sec-36-4"><span class="section-number-3">36.4</span> <b>Approx. total time</b>: 10 minutes</h3>
</div>
</div>
<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> KEGG Distances</h2>
<div class="outline-text-2" id="text-37">
</div><div id="outline-container-sec-37-1" class="outline-3">
<h3 id="sec-37-1"><span class="section-number-3">37.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-37-2" class="outline-3">
<h3 id="sec-37-2"><span class="section-number-3">37.2</span> <b>Pre-processing required:</b> No, done by loader.</h3>
</div>
<div id="outline-container-sec-37-3" class="outline-3">
<h3 id="sec-37-3"><span class="section-number-3">37.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-37-4" class="outline-3">
<h3 id="sec-37-4"><span class="section-number-3">37.4</span> <b>Approx. total time</b>: 10 minutes</h3>
</div>
</div>
<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> KEGG Nearest Tclin</h2>
<div class="outline-text-2" id="text-38">
</div><div id="outline-container-sec-38-1" class="outline-3">
<h3 id="sec-38-1"><span class="section-number-3">38.1</span> <b>Download Required:</b> No</h3>
</div>
<div id="outline-container-sec-38-2" class="outline-3">
<h3 id="sec-38-2"><span class="section-number-3">38.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-38-3" class="outline-3">
<h3 id="sec-38-3"><span class="section-number-3">38.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-38-4" class="outline-3">
<h3 id="sec-38-4"><span class="section-number-3">38.4</span> <b>Approx. total time</b>: &lt; 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> WikiPathways</h2>
<div class="outline-text-2" id="text-39">
</div><div id="outline-container-sec-39-1" class="outline-3">
<h3 id="sec-39-1"><span class="section-number-3">39.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-39-2" class="outline-3">
<h3 id="sec-39-2"><span class="section-number-3">39.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-39-3" class="outline-3">
<h3 id="sec-39-3"><span class="section-number-3">39.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-39-4" class="outline-3">
<h3 id="sec-39-4"><span class="section-number-3">39.4</span> <b>Approx. total time</b>: &lt; 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> Reactome Pathways</h2>
<div class="outline-text-2" id="text-40">
</div><div id="outline-container-sec-40-1" class="outline-3">
<h3 id="sec-40-1"><span class="section-number-3">40.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-40-2" class="outline-3">
<h3 id="sec-40-2"><span class="section-number-3">40.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-40-3" class="outline-3">
<h3 id="sec-40-3"><span class="section-number-3">40.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-40-4" class="outline-3">
<h3 id="sec-40-4"><span class="section-number-3">40.4</span> <b>Approx. total time</b>: 15 minutes</h3>
</div>
</div>
<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> PathwayCommons</h2>
<div class="outline-text-2" id="text-41">
</div><div id="outline-container-sec-41-1" class="outline-3">
<h3 id="sec-41-1"><span class="section-number-3">41.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-41-2" class="outline-3">
<h3 id="sec-41-2"><span class="section-number-3">41.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-41-3" class="outline-3">
<h3 id="sec-41-3"><span class="section-number-3">41.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-41-4" class="outline-3">
<h3 id="sec-41-4"><span class="section-number-3">41.4</span> <b>Approx. total time</b>: &lt; 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> JensenLab COMPARTMENTS</h2>
<div class="outline-text-2" id="text-42">
</div><div id="outline-container-sec-42-1" class="outline-3">
<h3 id="sec-42-1"><span class="section-number-3">42.1</span> <b>Download Required:</b> No, done by loader</h3>
</div>
<div id="outline-container-sec-42-2" class="outline-3">
<h3 id="sec-42-2"><span class="section-number-3">42.2</span> <b>Pre-processing required:</b> None</h3>
</div>
<div id="outline-container-sec-42-3" class="outline-3">
<h3 id="sec-42-3"><span class="section-number-3">42.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-42-4" class="outline-3">
<h3 id="sec-42-4"><span class="section-number-3">42.4</span> <b>Approx. total time</b>: 40 minutes</h3>
</div>
</div>
<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> Transcription Factor Flags</h2>
<div class="outline-text-2" id="text-43">
</div><div id="outline-container-sec-43-1" class="outline-3">
<h3 id="sec-43-1"><span class="section-number-3">43.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-43-2" class="outline-3">
<h3 id="sec-43-2"><span class="section-number-3">43.2</span> <b>Pre-processing required:</b> Yes</h3>
</div>
<div id="outline-container-sec-43-3" class="outline-3">
<h3 id="sec-43-3"><span class="section-number-3">43.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-43-4" class="outline-3">
<h3 id="sec-43-4"><span class="section-number-3">43.4</span> <b>Approx. total time</b>: &lt; 5 minutes</h3>
</div>
</div>
<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> TMHMM Predictions</h2>
<div class="outline-text-2" id="text-44">
</div><div id="outline-container-sec-44-1" class="outline-3">
<h3 id="sec-44-1"><span class="section-number-3">44.1</span> <b>Download Required:</b> Yes</h3>
</div>
<div id="outline-container-sec-44-2" class="outline-3">
<h3 id="sec-44-2"><span class="section-number-3">44.2</span> <b>Pre-processing required:</b> Yes</h3>
</div>
<div id="outline-container-sec-44-3" class="outline-3">
<h3 id="sec-44-3"><span class="section-number-3">44.3</span> <b>Manual post-processing:</b> None</h3>
</div>
<div id="outline-container-sec-44-4" class="outline-3">
<h3 id="sec-44-4"><span class="section-number-3">44.4</span> <b>Approx. total time</b>: 1 hour</h3>
</div>
</div>
<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> PANTHER Classes</h2>
